In [1]:
import pandas as pd

# Cargar el archivo Excel en un DataFrame
name = '../../titanic.xlsx'
df = pd.read_excel(name)

mayores30 = df[df['Edad'] > 30]['Nombre']
mayores30.head()

1     Cumings, Mrs. John Bradley (Florence Briggs Th...
3          Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                              Allen, Mr. William Henry
6                               McCarthy, Mr. Timothy J
11                             Bonnell, Miss. Elizabeth
Name: Nombre, dtype: object

In [2]:
mujeres1 = df[(df['Sexo'] == "Femenino")&(df['Familiares'] > 0)]['Nombre']
mujeres1.head()

8     Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
10                      Sandstrom, Miss. Marguerite Rut
24                        Palsson, Miss. Torborg Danira
25    Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...
43             Laroche, Miss. Simonne Marie Anne Andree
Name: Nombre, dtype: object

In [3]:

# Seleccionar las filas 0 a 10 y las columnas 2 a 6
seleccion = df.iloc[0:11, 2:7]

# Mostrar la selecci√≥n
seleccion.head()

,Clase,Nombre,Sexo,Edad,Familiares
0,3,"Braund, Mr. Owen Harris",Masculino,22.0,0
1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",Femenino,38.0,0
2,3,"Heikkinen, Miss. Laina",Femenino,26.0,0
3,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",Femenino,35.0,0
4,3,"Allen, Mr. William Henry",Masculino,35.0,0